Dlubal.RFEM5.SurfaceStiffness
Surface stiffness parameters

Dlubal.RFEM5.SurfaceStiffness.No
Number

Dlubal.RFEM5.SurfaceStiffness.ID
Identifier

Dlubal.RFEM5.SurfaceStiffness.Comment
Comment

Dlubal.RFEM5.SurfaceStiffness.Tag
Tag

Dlubal.RFEM5.SurfaceStiffness.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.SurfaceStiffness.Type
Orthotropy type

Dlubal.RFEM5.SurfaceStiffness.Rotation
Rotation about z-axis of local surface coordinate system

Dlubal.RFEM5.SurfaceStiffness.MultiplicationFactors
Multiplication factors

Dlubal.RFEM5.SurfaceStiffness.GeometricProperties
Geometric properties

Dlubal.RFEM5.SurfaceStiffness.Thickness
Thickness d

Dlubal.RFEM5.SurfaceStiffness.ConsiderSelfWeight
Thickness for consideration of self-weight

Dlubal.RFEM5.SurfaceStiffness.SelfWeight
Self-weight wt